src/cfe/Catalogs/кбп_Задачи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>кбп_Задачи</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Процесс</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.кбп_Процессы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Шаг</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.кбп_ЭлементыСхем</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдМаркера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.кбп_СостоянияЗадач</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Назначенный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Роль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.кбп_РолиИсполнителей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектАдресации1</Name>
					<Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектАдресации2</Name>
					<Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Замещение</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.кбп_Замещение</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПринятаКИсполнению</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПринялКИсполнению</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПринятия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Срок</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Результат</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Итерация</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоКопия</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Предмет</Name>
					<Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеПредмета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cfe/Enums/кбп_ВидыДействий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>кбп_ВидыДействий</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Переход</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Завершить</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Вернуть</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Переадресовать</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обработчик</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОткрытьФорму</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапуститьВложенный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прервать</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cfe/Enums/кбп_ВидыКнопок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>кбп_ВидыКнопок</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Основная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обычная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Опасная</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cfe/Catalogs/кбп_Задачи/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Объект.Ссылка.Пустая() Тогда
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Задачи создаются процессом. Запустите процесс: «Бизнес-процессы» → «Мои задачи» → «Запустить процесс…».'"));
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	ОбновитьНаСервере();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// Кнопки шага, созданные в СоздатьКнопки.
&НаКлиенте
Процедура Подключаемый_ВыполнитьДействие(Команда)

	Строки = Кнопки.НайтиСтроки(Новый Структура("ИмяКоманды", Команда.Имя));
	Если Строки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	Описание = Строки[0];

	Если Описание.ЭтоВозврат Тогда
		ВыбратьШагВозврата();
		Возврат;
	КонецЕсли;
	Если Описание.КомментарийОбязателен И Не ЗначениеЗаполнено(СокрЛП(Комментарий)) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			СтрШаблон(НСтр("ru = 'Для действия «%1» напишите комментарий.'"), Описание.Заголовок), , "Комментарий");
		Возврат;
	КонецЕсли;
	Если Описание.Подтверждение Тогда
		Текст = ?(ЗначениеЗаполнено(Описание.ТекстПодтверждения), Описание.ТекстПодтверждения,
			СтрШаблон(НСтр("ru = 'Выполнить «%1»?'"), Описание.Заголовок));
		ПоказатьВопрос(Новый ОписаниеОповещения("ВыполнитьДействиеПослеПодтверждения", ЭтотОбъект, Описание.ИдКнопки),
			Текст, РежимДиалогаВопрос.ДаНет);
		Возврат;
	КонецЕсли;
	ВыполнитьДействие(Описание.ИдКнопки);

КонецПроцедуры

&НаКлиенте
Процедура ПринятьКИсполнению(Команда)
	ПринятьКИсполнениюНаСервере();
	Оповестить("кбп_ИзменениеЗадачи", Объект.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьКомментарий(Команда)

	Если Не ЗначениеЗаполнено(СокрЛП(Комментарий)) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Напишите комментарий.'"), , "Комментарий");
		Возврат;
	КонецЕсли;
	ДобавитьКомментарийНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПроцесс(Команда)
	ПоказатьЗначение(, Объект.Процесс);
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	ОбновитьНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ВыполнитьДействиеПослеПодтверждения(Ответ, ИдКнопки) Экспорт
	Если Ответ = КодВозвратаДиалога.Да Тогда
		ВыполнитьДействие(ИдКнопки);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьДействие(ИдКнопки)

	ВыполнитьДействиеНаСервере(ИдКнопки);
	ПослеВыполнения(НСтр("ru = 'Задача выполнена'"));

КонецПроцедуры

&НаКлиенте
Процедура ВыбратьШагВозврата()

	Шаги = ШагиВозврата(Объект.Ссылка);
	Если Шаги.Количество() = 0 Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Нет пройденных шагов, на которые можно вернуть задачу.'"));
		Возврат;
	КонецЕсли;
	Если Шаги.Количество() = 1 Тогда
		ВыборШагаВозвратаЗавершение(Шаги[0], Неопределено);
		Возврат;
	КонецЕсли;
	ПоказатьВыборИзСписка(Новый ОписаниеОповещения("ВыборШагаВозвратаЗавершение", ЭтотОбъект), Шаги,
		Элементы.Комментарий);

КонецПроцедуры

&НаКлиенте
Процедура ВыборШагаВозвратаЗавершение(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт

	Если ВыбранныйЭлемент = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Если ЗначениеЗаполнено(СокрЛП(Комментарий)) Тогда
		ВернутьЗадачу(ВыбранныйЭлемент.Значение, Комментарий);
		Возврат;
	КонецЕсли;
	ПоказатьВводСтроки(Новый ОписаниеОповещения("ВводКомментарияВозвратаЗавершение", ЭтотОбъект, ВыбранныйЭлемент.Значение),
		, СтрШаблон(НСтр("ru = 'Что доработать (возврат на «%1»)'"), ВыбранныйЭлемент.Представление), , Истина);

КонецПроцедуры

&НаКлиенте
Процедура ВводКомментарияВозвратаЗавершение(ВведенныйТекст, Шаг) Экспорт

	Если Не ЗначениеЗаполнено(СокрЛП(ВведенныйТекст)) Тогда
		Возврат;
	КонецЕсли;
	ВернутьЗадачу(Шаг, ВведенныйТекст);

КонецПроцедуры

&НаКлиенте
Процедура ВернутьЗадачу(Шаг, ТекстКомментария)

	ВернутьНаСервере(Шаг, ТекстКомментария);
	ПослеВыполнения(НСтр("ru = 'Задача возвращена на доработку'"));

КонецПроцедуры

&НаКлиенте
Процедура ПослеВыполнения(Текст)

	Оповестить("кбп_ИзменениеЗадачи", Объект.Ссылка);
	ПоказатьОповещениеПользователя(Текст, ПолучитьНавигационнуюСсылку(Объект.Ссылка), Строка(Объект.Ссылка));
	Закрыть();

КонецПроцедуры

&НаСервереБезКонтекста
Функция ШагиВозврата(Задача)
	Возврат кбп_Движок.ШагиДляВозврата(Задача);
КонецФункции

&НаСервере
Процедура ВыполнитьДействиеНаСервере(ИдКнопки)
	кбп_ПроцессыAPI.ВыполнитьДействие(Объект.Ссылка, ИдКнопки, Комментарий);
	Комментарий = "";
КонецПроцедуры

&НаСервере
Процедура ВернутьНаСервере(Шаг, ТекстКомментария)
	кбп_ПроцессыAPI.ВернутьНаДоработку(Объект.Ссылка, Шаг, ТекстКомментария);
	Комментарий = "";
КонецПроцедуры

&НаСервере
Процедура ПринятьКИсполнениюНаСервере()
	кбп_Движок.ПринятьКИсполнению(Объект.Ссылка);
	ОбновитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ДобавитьКомментарийНаСервере()
	кбп_ПроцессыAPI.ДобавитьКомментарий(Объект.Процесс, Комментарий, Объект.Ссылка);
	Комментарий = "";
	ЗаполнитьЖурнал();
КонецПроцедуры

&НаСервере
Процедура ОбновитьНаСервере()

	ЗначениеВРеквизитФормы(Объект.Ссылка.ПолучитьОбъект(), "Объект");
	Инструкция = Объект.Шаг.Инструкция;
	МожноВыполнить = кбп_Движок.МожноВыполнитьЗадачу(Объект.Ссылка);
	Заголовок = СтрШаблон(НСтр("ru = 'Задача: %1'"), Объект.Наименование);
	Элементы.Инструкция.Видимость = ЗначениеЗаполнено(Инструкция);
	Элементы.ФормаПринятьКИсполнению.Видимость = МожноВыполнить И Не Объект.ПринятаКИсполнению;
	Элементы.Результат.Видимость = Не МожноВыполнить И ЗначениеЗаполнено(Объект.Результат);
	Результат = кбп_Действия.ЗаголовокКнопки(Объект.Шаг, Объект.Результат);
	Если ЗначениеЗаполнено(Объект.Комментарий) Тогда
		Результат = Результат + ": " + Объект.Комментарий;
	КонецЕсли;
	СоздатьКнопки();
	ЗаполнитьЖурнал();

КонецПроцедуры

// Кнопки шага создаются программно (Архитектура п. 8.1).
&НаСервере
Процедура СоздатьКнопки()

	Для Каждого Описание Из Кнопки Цикл
		Элемент = Элементы.Найти(Описание.ИмяКоманды);
		Если Элемент <> Неопределено Тогда
			Элементы.Удалить(Элемент);
		КонецЕсли;
		Команда = Команды.Найти(Описание.ИмяКоманды);
		Если Команда <> Неопределено Тогда
			Команды.Удалить(Команда);
		КонецЕсли;
	КонецЦикла;
	Кнопки.Очистить();

	Номер = 0;
	ЕстьОсновная = Ложь;
	Для Каждого КнопкаШага Из кбп_Действия.КнопкиЗадачи(Объект.Ссылка) Цикл
		Номер = Номер + 1;
		Описание = Кнопки.Добавить();
		Описание.ИмяКоманды = "кбп_Кнопка" + Формат(Номер, "ЧГ=0");
		Описание.ИдКнопки = КнопкаШага.ИдКнопки;
		Описание.Заголовок = КнопкаШага.Заголовок;
		Описание.ЭтоВозврат = (КнопкаШага.Действие = Перечисления.кбп_ВидыДействий.Вернуть);
		Описание.Подтверждение = КнопкаШага.Подтверждение;
		Описание.ТекстПодтверждения = КнопкаШага.ТекстПодтверждения;
		Описание.КомментарийОбязателен = КнопкаШага.КомментарийОбязателен;

		Команда = Команды.Добавить(Описание.ИмяКоманды);
		Команда.Заголовок = КнопкаШага.Заголовок;
		Команда.Действие = "Подключаемый_ВыполнитьДействие";

		Кнопка = Элементы.Добавить(Описание.ИмяКоманды, Тип("КнопкаФормы"), Элементы.Действия);
		Кнопка.ИмяКоманды = Описание.ИмяКоманды;
		Кнопка.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
		Если КнопкаШага.Вид = Перечисления.кбп_ВидыКнопок.Основная И Не ЕстьОсновная Тогда
			Кнопка.КнопкаПоУмолчанию = Истина;
			ЕстьОсновная = Истина;
		ИначеЕсли КнопкаШага.Вид = Перечисления.кбп_ВидыКнопок.Опасная Тогда
			Кнопка.ЦветТекста = WebЦвета.Красный;
		КонецЕсли;
	КонецЦикла;

	Элементы.Комментарий.Видимость = Истина;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЖурнал()

	Журнал.Очистить();
	Для Каждого Запись Из кбп_Движок.ЖурналПроцесса(Объект.Процесс) Цикл
		ЗаполнитьЗначенияСвойств(Журнал.Добавить(), Запись);
	КонецЦикла;

КонецПроцедуры

#КонецОбласти
